{
	"@metadata": {
		"authors": [
			"Dejan Savuljesku",
			"Patric Wirth",
			"Umherirrender",
			"Verdy p"
		]
	},
	"pagecheckout-desc": "{{desc|name=PageCheckout}}",
	"pagecheckout-error-no-title": "Error message when given title is invalid",
	"pagecheckout-error-no-user": "Error message when given user is invalid",
	"pagecheckout-error-has-checkout": "Error message when given page already has a checked-out",
	"pagecheckout-error-save-failed": "Generic error message when the checkout failed",
	"pagecheckout-error-no-checkout": "Generic error message when the currently checked-out page can not be checked in",
	"pagecheckout-error-no-checkout-id": "Error message when an invalid checkout was given on check-in",
	"pagecheckout-error-db-insert": "Generic error message when the checkout could not be saved in the database",
	"pagecheckout-error-db-retrieve-inserted": "Generic error message when the inserted checkout could not retreived from the database",
	"pagecheckout-error-save-event": "Generic error message when an event could not be saved",
	"pagecheckout-lockdown-reason": "Extended permission error when the user is not allowed to perform an action on a page due to the page being checked out.\n*$1 - Action, that the user tried to perform on the checked-out page.\n*$2 - Username or Realname of the user, that the page is currently checkout-out to",
	"pagecheckout-action-clear-label": "Label for link, that allowes to clear the checkout for the current page.\n{{Identical|Clear checkout}}",
	"apihelp-pagecheckout-clear-example": "{{doc-apihelp-example|pagecheckout-clear}}",
	"apihelp-pagecheckout-clear-summary": "{{doc-apihelp-summary|pagecheckout-clear}}",
	"apihelp-pagecheckout-clear-param-page_title": "{{doc-apihelp-param|pagecheckout-clear|page_title}}",
	"pagecheckout-ui-clear-confirm": "Confirmation message that asks the user if the user really wants to clear the checkout-out of the current page and warns the user, that this will make page editable for all normally eligible users",
	"log-name-pagecheckout": "Used in [[Special:Log]], title of the log type.\n{{Identical|Page checkouts}}",
	"log-description-pagecheckout": "Used in [[Special:Log]], description of the log type",
	"logentry-pagecheckout-checkin": "Log message about a user, that checked-in a page for a user\n*$1 - Realname of the user, that checked-in a page for a user\n*$2 - Username of the user that checked-in a page for a user. Use GENDER\n*$3 - Name of the page, that was checked-in by the user for a user.\n*$4 - Realname of the user, the page was checked-in for",
	"logentry-pagecheckout-checkout": "Log message about a user, that checked-out a page for a user\n*$1 - Realname of the user, that checked-out a page for a user\n*$2 - Username of the user that checked-out a page for a user. Use GENDER\n*$3 - Name of the page, that was checked-out by the user for a user.\n*$4 - Realname of the user, the page was checked-out for",
	"pagecheckout-alertbanner-checkout": "Message in the banner on top of the page, that is currently checked-out for a user\n.*$1 - Username of the user, the page is currently checked-out for. Use GENDER\n*$2 - Realname of the user, the page is currently checked-out for.",
	"action-page-checkout-clear": "{{doc-action|page-checkout-clear}}",
	"right-page-checkout-clear": "{{doc-right|page-checkout-clear}}",
	"pagecheckout-alertbanner-checkout-with-comment": "Message in the banner on top of the page, that is currently checked-out for a user, when comment is available.\n\n*$1 - Username of the user, the page is currently checked-out for. To be used with GENDER.\n*$2 - Real name or display name of the user, the page is currently checked-out for.\n*$3 - Comment",
	"page-checkout-workflow-activity-checkout-reason": "Message in the banner on top of the page, that is currently checked-out, in case a generic checkout is set, due to a running workflow",
	"page-checkout-workflow-activity-checkout-non-generic-reason": "Comment on the checkout entity, when workflow checks the page out",
	"page-checkout-workflow-clear-checkout": "Comment text when page is checked-in due to workflow abort"
}
